In [12]:
import datetime

# Get the current date and time
current_time = datetime.datetime.now()

# Print the current date and time
print("Timestamp:", current_time)

Timestamp: 2024-03-28 13:04:13.745549

In [2]:
# pip install ipykernal
# pip install pandas
# pip install numpy
#pip install matplotlib  
#pip install seaborn
#pip install statsmodels
# pip install scikit-learn
# pip install openpyxl

In [39]:
df.head()

,survived,pclass,gender,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

**Lab session 1**\
Use dataset of penguins to find the correlation between the columns and to draw the regression plot for each variable as well as heatmap and pairplot

**Lab session 2**\
To perform exploratory data analysis using data of penguins to find different trends and patterns in the data

**Lab session 3**\
To perform the EDA on --------------- to find the different patterns and trends in the given dataset

**Lab Session 4**\
Write compete detail of left join, right join, inner and outer join. Develop two dataframes of 15 rows with columns as
data1= names of id, Name, nationality,age\
data2= id, Marks in math, marks in science, marks in english, marks in history
and merge these dataframes using all types of joins.

In [75]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
df=sns.load_dataset("titanic")
df.rename(columns={"sex":"gender"},inplace=True)
df.head()

,survived,pclass,gender,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [81]:
df.isnull().sum()

survived         0
pclass           0
gender           0
age              0
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [77]:
from sklearn.experimental import enable_iterative_imputer
from sklearn.impute import IterativeImputer

In [80]:
from sklearn.impute import KNNImputer
imputer=KNNImputer(n_neighbors=5)
df["age"]=imputer.fit_transform(df[["age"]])

In [83]:
# Merging of data
data1={"id":[1,2,3,4,5],"Name":["Ali", "Ahmed","Asad","Usman","Ahmed"], "Age":[23,24,25,26,27]}
data1=pd.DataFrame(data1)
data1

   id   Name  Age
0   1    Ali   23
1   2  Ahmed   24
2   3   Asad   25
3   4  Usman   26
4   5  Ahmed   27

In [84]:
data2={"id":[1,2,3,4,6], "City":["Karachi","Lahore","Islamabad","Quetta","Peshawar"], "occupation":["Engineer","Doctor","Teacher","Businessman","lawyer"]}
data2=pd.DataFrame(data2)
data2

   id       City   occupation
0   1    Karachi     Engineer
1   2     Lahore       Doctor
2   3  Islamabad      Teacher
3   4     Quetta  Businessman
4   6   Peshawar       lawyer

In [92]:
data3=pd.merge(data1,data2, on="id", how="outer")
data3

   id   Name   Age       City   occupation
0   1    Ali  23.0    Karachi     Engineer
1   2  Ahmed  24.0     Lahore       Doctor
2   3   Asad  25.0  Islamabad      Teacher
3   4  Usman  26.0     Quetta  Businessman
4   5  Ahmed  27.0        NaN          NaN
5   6    NaN   NaN   Peshawar       lawyer